Podkova/src/DataProcessors/Шиномонтаж/Шиномонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Шиномонтаж</name>
  <attributes>
    <name>Бригадир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Podkova/src/InformationRegisters/ШМ_Утиль/ШМ_Утиль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Утиль</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/DataProcessors/Шиномонтаж/Forms/Утиль/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_Утиль.Номенклатура,
		|	ШМ_Утиль.Количество
		|ИЗ
		|	РегистрСведений.ШМ_Утиль КАК ШМ_Утиль";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Таб.Загрузить(Выборка);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	НаборЗаписей = РегистрыСведений.ШМ_Утиль.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Для каждого стр из Таб Цикл
		НовыйНаборЗаписей = РегистрыСведений.ШМ_Утиль.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.Номенклатура.Установить(Стр.Номенклатура, Истина);
		
		НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
		НоваяЗаписьНабора.Номенклатура = Стр.Номенклатура;
		НоваяЗаписьНабора.Количество = Стр.Количество;
		НовыйНаборЗаписей.Записать();		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
КонецПроцедуры
